Testcases/SoapLibrary/XML/MultiplyRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Multiply xmlns="http://tempuri.org/">
            <intA>[int]</intA>
            <intB>[int]</intB>
        </Multiply>
    </Body>
</Envelope>