RestAPI/TestData/Add.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>71</intA>
            <intB>72</intB>
        </Add>
    </Body>
</Envelope>