RestAssured/SoapRequestFile/Add.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>2</intA>
            <intB>2</intB>
        </Add>
    </Body>
</Envelope>