Reports/TestSuitePartOne/20190803_181742/requests/main/1.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "request" : {
        "method" : "SOAP",
        "url" : "http://www.dneonline.com/calculator.asmx?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <Divide xmlns=\"http://tempuri.org/\">\n            <intA>20</intA>\n            <intB>2</intB>\n        </Divide>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 338,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><DivideResponse xmlns=\"http://tempuri.org/\"><DivideResult>10</DivideResult></DivideResponse></soap:Body></soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 183,
        "bodySize" : 338,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "wait" : 0,
        "dns" : -1,
        "blocked" : -1,
        "send" : 0,
        "receive" : 0,
        "connect" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "1",
        "testObjectId" : "Object Repository/PartOne/2-Request-Divide",
        "harId" : "3cdb2119-c84d-415a-a278-bbf2cae464fc"
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}